---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.RevitServerInternalException
source: html/f74b3284-ee3f-f4f0-2233-0723bc226578.htm
---
# RevitServerInternalException Methods

Retrieves data needed to serialize the target object.